In [3]:
# DATA PERTAMA
import pandas as pd
nama = ['Berti', 'Ryndes', 'Arin']
tugas = [95,90,75]
jurusan = ['IF', 'SI', 'KA']
df3 = pd.DataFrame({'Nama':nama, 'Tugas':tugas, 'Jurusan':jurusan})
df3

     Nama  Tugas Jurusan
0   Berti     95      IF
1  Ryndes     90      SI
2    Arin     75      KA

In [4]:
# DATA KEDUA
nama = ['Berti', 'Ryndes', 'Rylo']
tugas = [85,84,70]
jurusan = ['IF', 'SI', 'SI']
df4 = pd.DataFrame({'Nama':nama, 'Tugas':tugas, 'Jurusan':jurusan})
df4

     Nama  Tugas Jurusan
0   Berti     85      IF
1  Ryndes     84      SI
2    Rylo     70      SI

In [5]:
# INNER MERGE
df3.merge(df4)

Empty DataFrame
Columns: [Nama, Tugas, Jurusan]
Index: []

In [6]:
# LEFT MERGE
df3.merge(df4, on='Nama', how='left')

     Nama  Tugas_x Jurusan_x  Tugas_y Jurusan_y
0   Berti       95        IF     85.0        IF
1  Ryndes       90        SI     84.0        SI
2    Arin       75        KA      NaN       NaN

In [7]:
# RIGHT MERGE
df3.merge(df4, on='Nama', how='left')

     Nama  Tugas_x Jurusan_x  Tugas_y Jurusan_y
0   Berti       95        IF     85.0        IF
1  Ryndes       90        SI     84.0        SI
2    Arin       75        KA      NaN       NaN

In [8]:
# OUTER MERGE
df3.merge(df4, on='Nama', how='outer')

     Nama  Tugas_x Jurusan_x  Tugas_y Jurusan_y
0   Berti     95.0        IF     85.0        IF
1  Ryndes     90.0        SI     84.0        SI
2    Arin     75.0        KA      NaN       NaN
3    Rylo      NaN       NaN     70.0        SI